// ConsoleApplicationCppAsync.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

//#include "Threaf_f.h"
//#include "ConcurrentMap.h"
//#include "ThreadClass.h"
//#include "Task1rw.h"
//#include "ServerDBrw.h"
#include "Task2co.h"

//contfree_safe_ptr<std::map<string, int>> safe_map_string_int;

int main()
{
    //contfree_safe_ptr<std::map < long, string> >* map;
    //map = new contfree_safe_ptr<std::map < long, string> >;

    std::cout << "Begin read Devices: tcp, modbus, udp protocols !!!!\n";

    //***************************************************

	
    
 

    cout << "Press key " << endl;
    std::getchar();
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
